zilencer/tests/stripe_fixtures.json

{
    "create_customer": {
        "account_balance": 0,
        "created": 1529990750,
        "currency": null,
        "default_source": "card_1Ch9gVGh0CmXqmnwv94RombT",
        "delinquent": false,
        "description": "zulip (Zulip Dev)",
        "discount": null,
        "email": null,
        "id": "cus_D7OT2jf5YAtZQL",
        "invoice_prefix": "23ABC45",
        "livemode": false,
        "metadata": {
            "realm_id": "1",
            "realm_str": "zulip"
        },
        "object": "customer",
        "shipping": null,
        "sources": {
            "data": [
                {
                    "address_city": "Pacific",
                    "address_country": "United States",
                    "address_line1": "Under the sea",
                    "address_line1_check": "pass",
                    "address_line2": null,
                    "address_state": "FL",
                    "address_zip": "33333",
                    "address_zip_check": "pass",
                    "brand": "Visa",
                    "country": "US",
                    "customer": "cus_D7OT2jf5YAtZQL",
                    "cvc_check": "pass",
                    "dynamic_last4": null,
                    "exp_month": 3,
                    "exp_year": 2033,
                    "fingerprint": "6dAXT9VZvwro65EK",
                    "funding": "credit",
                    "id": "card_1Ch9gVGh0CmXqmnwv94RombT",
                    "last4": "4242",
                    "metadata": {},
                    "name": "Ada Starr",
                    "object": "card",
                    "tokenization_method": null
                }
            ],
            "has_more": false,
            "object": "list",
            "total_count": 1,
            "url": "/v1/customers/cus_D7OT2jf5YAtZQL/sources"
        },
        "subscriptions": {}
    },
    "create_subscription": {
        "application_fee_percent": null,
        "billing": "charge_automatically",
        "billing_cycle_anchor": 1529990751,
        "cancel_at_period_end": false,
        "canceled_at": null,
        "created": 1529990751,
        "current_period_end": 1561526751,
        "current_period_start": 1529990751,
        "customer": "cus_D7OT2jf5YAtZQL",
        "days_until_due": null,
        "discount": null,
        "ended_at": null,
        "id": "sub_D7OTT8FZbOPxah",
        "items": {
            "data": [
                {
                    "created": 1529990751,
                    "id": "si_D7OTEItF5ZLN2R",
                    "metadata": {},
                    "object": "subscription_item",
                    "plan": {
                        "active": true,
                        "aggregate_usage": null,
                        "amount": 8000,
                        "billing_scheme": "per_unit",
                        "created": 1529987890,
                        "currency": "usd",
                        "id": "plan_D7Nh2BtpTvIzYp",
                        "interval": "year",
                        "interval_count": 1,
                        "livemode": false,
                        "metadata": {},
                        "nickname": "annual",
                        "object": "plan",
                        "product": "prod_D7NhmicJvX2edE",
                        "tiers": null,
                        "tiers_mode": null,
                        "transform_usage": null,
                        "trial_period_days": null,
                        "usage_type": "licensed"
                    },
                    "quantity": 8,
                    "subscription": "sub_D7OTT8FZbOPxah"
                }
            ],
            "has_more": false,
            "object": "list",
            "total_count": 1,
            "url": "/v1/subscription_items?subscription=sub_D7OTT8FZbOPxah"
        },
        "livemode": false,
        "metadata": {},
        "object": "subscription",
        "plan": {
            "active": true,
            "aggregate_usage": null,
            "amount": 8000,
            "billing_scheme": "per_unit",
            "created": 1529987890,
            "currency": "usd",
            "id": "plan_D7Nh2BtpTvIzYp",
            "interval": "year",
            "interval_count": 1,
            "livemode": false,
            "metadata": {},
            "nickname": "annual",
            "object": "plan",
            "product": "prod_D7NhmicJvX2edE",
            "tiers": null,
            "tiers_mode": null,
            "transform_usage": null,
            "trial_period_days": null,
            "usage_type": "licensed"
        },
        "quantity": 8,
        "start": 1529990751,
        "status": "active",
        "tax_percent": 0.0,
        "trial_end": null,
        "trial_start": null
    },
    "retrieve_customer": {
        "account_balance": 0,
        "created": 1529990750,
        "currency": "usd",
        "default_source": "card_1Ch9gVGh0CmXqmnwv94RombT",
        "delinquent": false,
        "description": "zulip (Zulip Dev)",
        "discount": null,
        "email": null,
        "id": "cus_D7OT2jf5YAtZQL",
        "invoice_prefix": "23ABC45",
        "livemode": false,
        "metadata": {
            "realm_id": "1",
            "realm_str": "zulip"
        },
        "object": "customer",
        "shipping": null,
        "sources": {
            "data": [
                {
                    "address_city": "Pacific",
                    "address_country": "United States",
                    "address_line1": "Under the sea",
                    "address_line1_check": "pass",
                    "address_line2": null,
                    "address_state": "FL",
                    "address_zip": "33333",
                    "address_zip_check": "pass",
                    "brand": "Visa",
                    "country": "US",
                    "customer": "cus_D7OT2jf5YAtZQL",
                    "cvc_check": "pass",
                    "dynamic_last4": null,
                    "exp_month": 3,
                    "exp_year": 2033,
                    "fingerprint": "6dAXT9VZvwro65EK",
                    "funding": "credit",
                    "id": "card_1Ch9gVGh0CmXqmnwv94RombT",
                    "last4": "4242",
                    "metadata": {},
                    "name": "Ada Starr",
                    "object": "card",
                    "tokenization_method": null
                }
            ],
            "has_more": false,
            "object": "list",
            "total_count": 1,
            "url": "/v1/customers/cus_D7OT2jf5YAtZQL/sources"
        },
        "subscriptions": {
            "data": [
                {
                    "application_fee_percent": null,
                    "billing": "charge_automatically",
                    "billing_cycle_anchor": 1529990751,
                    "cancel_at_period_end": false,
                    "canceled_at": null,
                    "created": 1529990751,
                    "current_period_end": 1561526751,
                    "current_period_start": 1529990751,
                    "customer": "cus_D7OT2jf5YAtZQL",
                    "days_until_due": null,
                    "discount": null,
                    "ended_at": null,
                    "id": "sub_D7OTT8FZbOPxah",
                    "items": {
                        "data": [
                            {
                                "created": 1529990751,
                                "id": "si_D7OTEItF5ZLN2R",
                                "metadata": {},
                                "object": "subscription_item",
                                "plan": {
                                    "active": true,
                                    "aggregate_usage": null,
                                    "amount": 8000,
                                    "billing_scheme": "per_unit",
                                    "created": 1529987890,
                                    "currency": "usd",
                                    "id": "plan_D7Nh2BtpTvIzYp",
                                    "interval": "year",
                                    "interval_count": 1,
                                    "livemode": false,
                                    "metadata": {},
                                    "nickname": "annual",
                                    "object": "plan",
                                    "product": "prod_D7NhmicJvX2edE",
                                    "tiers": null,
                                    "tiers_mode": null,
                                    "transform_usage": null,
                                    "trial_period_days": null,
                                    "usage_type": "licensed"
                                },
                                "quantity": 8,
                                "subscription": "sub_D7OTT8FZbOPxah"
                            }
                        ],
                        "has_more": false,
                        "object": "list",
                        "total_count": 1,
                        "url": "/v1/subscription_items?subscription=sub_D7OTT8FZbOPxah"
                    },
                    "livemode": false,
                    "metadata": {},
                    "object": "subscription",
                    "plan": {
                        "active": true,
                        "aggregate_usage": null,
                        "amount": 8000,
                        "billing_scheme": "per_unit",
                        "created": 1529987890,
                        "currency": "usd",
                        "id": "plan_D7Nh2BtpTvIzYp",
                        "interval": "year",
                        "interval_count": 1,
                        "livemode": false,
                        "metadata": {},
                        "nickname": "annual",
                        "object": "plan",
                        "product": "prod_D7NhmicJvX2edE",
                        "tiers": null,
                        "tiers_mode": null,
                        "transform_usage": null,
                        "trial_period_days": null,
                        "usage_type": "licensed"
                    },
                    "quantity": 8,
                    "start": 1529990751,
                    "status": "active",
                    "tax_percent": 0.0,
                    "trial_end": null,
                    "trial_start": null
                }
            ],
            "has_more": false,
            "object": "list",
            "total_count": 1,
            "url": "/v1/customers/cus_D7OT2jf5YAtZQL/subscriptions"
        }
    },
    "upcoming_invoice": {
        "amount_due": 64000,
        "amount_paid": 0,
        "amount_remaining": 64000,
        "application_fee": null,
        "attempt_count": 0,
        "attempted": false,
        "billing": "charge_automatically",
        "billing_reason": "upcoming",
        "charge": null,
        "closed": false,
        "currency": "usd",
        "customer": "cus_D7OT2jf5YAtZQL",
        "date": 1561526751,
        "description": "",
        "discount": null,
        "due_date": null,
        "ending_balance": null,
        "forgiven": false,
        "lines": {
            "data": [
                {
                    "amount": 64000,
                    "currency": "usd",
                    "description": "8 user \u00d7 Zulip Cloud Premium (at $80.00 / year)",
                    "discountable": true,
                    "id": "sub_D7OTT8FZbOPxah",
                    "livemode": false,
                    "metadata": {},
                    "object": "line_item",
                    "period": {
                        "end": 1593149151,
                        "start": 1561526751
                    },
                    "plan": {
                        "active": true,
                        "aggregate_usage": null,
                        "amount": 8000,
                        "billing_scheme": "per_unit",
                        "created": 1529987890,
                        "currency": "usd",
                        "id": "plan_D7Nh2BtpTvIzYp",
                        "interval": "year",
                        "interval_count": 1,
                        "livemode": false,
                        "metadata": {},
                        "nickname": "annual",
                        "object": "plan",
                        "product": "prod_D7NhmicJvX2edE",
                        "tiers": null,
                        "tiers_mode": null,
                        "transform_usage": null,
                        "trial_period_days": null,
                        "usage_type": "licensed"
                    },
                    "proration": false,
                    "quantity": 8,
                    "subscription": null,
                    "subscription_item": "si_D7OTEItF5ZLN2R",
                    "type": "subscription"
                }
            ],
            "has_more": false,
            "object": "list",
            "total_count": 1,
            "url": "/v1/invoices/upcoming/lines?customer=cus_D7OT2jf5YAtZQL"
        },
        "livemode": false,
        "metadata": {},
        "next_payment_attempt": 1561530351,
        "number": "23ABC45-0002",
        "object": "invoice",
        "paid": false,
        "period_end": 1561526751,
        "period_start": 1529990751,
        "receipt_number": null,
        "starting_balance": 0,
        "statement_descriptor": null,
        "subscription": "sub_D7OTT8FZbOPxah",
        "subtotal": 64000,
        "tax": 0,
        "tax_percent": 0.0,
        "total": 64000,
        "webhooks_delivered_at": null
    },
}
